In [2]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [3]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

Displays information about the tables in the database.

In [4]:
%%sql
SELECT *
  FROM facts
 LIMIT 5

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [5]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
  FROM facts

Done.

[(0, 7256490011, 0.0, 4.02)]

Here we calculated some summary statistics on the facts table.

In [6]:
%%sql
SELECT name
  FROM facts
    WHERE population = (SELECT MIN(population)
                         FROM facts);

Done.

[('Antarctica',)]

This calculates the country with the smallest population using a where statement and a subquery.

In [18]:
%%sql
SELECT name
  FROM facts
    WHERE population = (SELECT MAX(population)
                         FROM facts
                        WHERE name != 'World');

Done.

[('China',)]

Same thing as before, but now we calculate the country witht the largest population, and since World is included as a country in this table we filter that row out.

In [8]:
%%sql
SELECT name
  FROM facts
    WHERE population_growth == (SELECT MIN(population_growth)
                         FROM facts);

Done.

[('Holy See (Vatican City)',),
 ('Cocos (Keeling) Islands',),
 ('Greenland',),
 ('Pitcairn Islands',)]

Again, same thing but now smallest population growth.

In [9]:
%%sql
SELECT name
  FROM facts
    WHERE population_growth == (SELECT MAX(population_growth)
                         FROM facts);

Done.

[('South Sudan',)]

Now the largest population growth.

In [10]:
%%sql
SELECT AVG(population)
  FROM facts

Done.

[(62094928.32231405,)]

Calculated average population of all countries.

In [24]:
%%sql
SELECT AVG(area)
    FROM facts

Done.

[(555093.546184739,)]

Calculated average area of all countries.

In [25]:
%%sql
SELECT name
  FROM facts
    WHERE population > (SELECT AVG(population)
                         FROM facts) 
    AND area < (SELECT AVG(area)
                        FROM facts)

Done.

[('Bangladesh',),
 ('Germany',),
 ('Japan',),
 ('Philippines',),
 ('Thailand',),
 ('United Kingdom',),
 ('Vietnam',)]

Here we found a list of countries where the population is above average and the area is below average.

In [13]:
%%sql
SELECT name, area_water, area_land
  FROM facts
    WHERE area_water /area_land > (SELECT AVG(area_water /area_land)
                                     FROM facts
                                  );

Done.

[('British Indian Ocean Territory', 54340, 60), ('Virgin Islands', 1564, 346)]

Here we found which countries have the highest ratio of water to land, and where there is more water than land, which I found to be the same results

In [14]:
%%sql
SELECT name, area_water, area_land
  FROM facts
    
    WHERE area_water  > area_land

Done.

[('British Indian Ocean Territory', 54340, 60), ('Virgin Islands', 1564, 346)]

In [28]:
%%sql
SELECT name, population_growth * population as growth
  FROM facts
    WHERE name != 'World'
    ORDER BY growth DESC
    LIMIT 5

Done.

[('India', 1527068612.48),
 ('China', 615368424.6),
 ('Nigeria', 444827037.20000005),
 ('Pakistan', 290665336.62),
 ('Ethiopia', 287456216.91)]

Here we found the countries that will add the most people to their populations the next year.

In [29]:
%%sql
SELECT name
  FROM facts
    WHERE birth_rate < death_rate
    LIMIT 10

Done.

[('Austria',),
 ('Belarus',),
 ('Bosnia and Herzegovina',),
 ('Bulgaria',),
 ('Croatia',),
 ('Czech Republic',),
 ('Estonia',),
 ('Germany',),
 ('Greece',),
 ('Hungary',)]

Here I found which countries have a higher death rate than birth rate.

In [36]:
%%sql
SELECT name AS name1, population/area AS pop_density
    FROM facts
    ORDER BY population/area DESC
    LIMIT 10;

Done.

[('Macau', 21168),
 ('Monaco', 15267),
 ('Singapore', 8141),
 ('Hong Kong', 6445),
 ('Gaza Strip', 5191),
 ('Gibraltar', 4876),
 ('Bahrain', 1771),
 ('Maldives', 1319),
 ('Malta', 1310),
 ('Bermuda', 1299)]

Lastly, I found which countries have the hig